Revit 2027 API
BuiltInFailures.ViewFailures.NothingToApplyWarning Property
 Start and end elevations are the same, nothing to Apply.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NothingToApplyWarning { get; }
Public Shared ReadOnly Property NothingToApplyWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NothingToApplyWarning {
	FailureDefinitionId^ get ();
}
static member NothingToApplyWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace